Documents/ГрафикРаботыМонтажныхБригад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ГрафикРаботыМонтажныхБригад</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Невыходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Бригады</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Бригада</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Бригады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ГрафикРаботыМонтажныхБригад/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Ключ.Пустая() Тогда

	Иначе
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);		
	КонецЕсли;	
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОтображениеПериодаРегистрации = Формат(Объект.ПериодРегистрации, "ДФ='MMMM yyyy'");
	
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);
	
	ВремяНачалаГрафика    = Константы.НачалоРабочегоВремениМонтажей.Получить();
	ВремяОкончанияГрафика = Константы.КонецРабочегоВремениМонтажей.Получить();
	
	ДатаНачалаГрафика = НачалоМесяца(Объект.ПериодРегистрации);
	ДатаОкончанияГрафика = КонецМесяца(Объект.ПериодРегистрации);
	
	Элементы.УстановитьМесяц.Пометка = Истина;
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	РеквизитыПользователя = ОбщийМодульСервер.НастройкиПользователя("ФильтроватьГрафикМонтажейПоТочкеПродаж, ТочкаПродаж,
												|ОграничитьВидимостьМонтажныхБригадПоПодразделениюПользователя, ПодразделениеРозница", ТекущийПользователь);
	
	Если РеквизитыПользователя.ФильтроватьГрафикМонтажейПоТочкеПродаж Тогда
		ФильтрТочкаПродаж = РеквизитыПользователя.ТочкаПродаж;
		Элементы.ФильтрТочкаПродаж.Доступность = Ложь;
	КонецЕсли;
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПодразделения") Тогда // #15664
		Если РеквизитыПользователя.ОграничитьВидимостьМонтажныхБригадПоПодразделениюПользователя Тогда
			ФильтрПодразделение = РеквизитыПользователя.ПодразделениеРозница;
			Элементы.ФильтрПодразделение.Доступность = Ложь;
		КонецЕсли;
	Иначе
		Элементы.ФильтрПодразделение.Видимость = Ложь;
	КонецЕсли; 
	
	ЗаполнитьВычисляемыеРеквизитыТабличнойЧасти();
	ОтборСтрокТабличнойЧасти();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("ОбновитьГрафикОбработчикОжидания", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПроверкаТаблицыДокумента(Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЗаполнитьВычисляемыеРеквизитыТабличнойЧасти();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ИсточникВыбора) = Тип("УправляемаяФорма")
		И СтрНайти(ИсточникВыбора.ИмяФормы, "ФормаКалендаря") > 0 Тогда
		
		Если НЕ Объект.ПериодРегистрации = НачалоМесяца(ВыбранноеЗначение) Тогда
			Если Объект.Бригады.Количество() > 0 Тогда
				ОписаниеОповещения = Новый ОписаниеОповещения("ОтображениеПериодаРегистрацииНачалоВыбораПослеВопроса", ЭтотОбъект, ВыбранноеЗначение);
				ПоказатьВопрос(ОписаниеОповещения, "Данные по периоду будут очищены. Продолжить?", РежимДиалогаВопрос.ДаНет);				
			Иначе
				ОтображениеПериодаРегистрацииНачалоВыбораЗавершение(ВыбранноеЗначение);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаПодбораВГрафикРаботы" Тогда		
		ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение);
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаВыбора()

#КонецОбласти

#Область ОбработчикиЭлементовФормы

&НаКлиенте
Процедура ОбновитьГрафикОбработчикОжидания()
	
	ОчиститьСообщения();
	ОбновитьГрафикСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеПериодаРегистрацииРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Объект.Бригады.Количество() > 0 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ОтображениеПериодаРегистрацииРегулированиеПослеВопроса", ЭтотОбъект, Направление);
		ПоказатьВопрос(ОписаниеОповещения, "Данные по текущему периоду будут очищены. Продолжить?", РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	ОтображениеПериодаРегистрацииРегулированиеЗавершение(Направление);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеПериодаРегистрацииРегулированиеПослеВопроса(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Бригады.Очистить();
	ОтображениеПериодаРегистрацииРегулированиеЗавершение(ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеПериодаРегистрацииРегулированиеЗавершение(Направление)	
	
	ОчиститьСообщения();
	Модифицированность = Истина;
	Объект.ПериодРегистрации = ?(ЗначениеЗаполнено(Объект.ПериодРегистрации), 
							ДобавитьМесяц(Объект.ПериодРегистрации, Направление),
							ДобавитьМесяц(НачалоМесяца(ТекущаяДата()), Направление));							
	Объект.ПериодРегистрации 		= НачалоМесяца(Объект.ПериодРегистрации);
	ОтображениеПериодаРегистрации 	= Формат(Объект.ПериодРегистрации, "ДФ='MMMM yyyy'");
	ДатаНачалаГрафика = НачалоМесяца(Объект.ПериодРегистрации);
	ДатаОкончанияГрафика = КонецМесяца(Объект.ПериодРегистрации);
	
	ОбновитьГрафикСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеПериодаРегистрацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка	 = Ложь;
	ДатаКалендаряПриОткрытии = ?(ЗначениеЗаполнено(Объект.ПериодРегистрации), Объект.ПериодРегистрации, ТекущаяДата());
	СтруктураПараметров 	 = Новый Структура("ДатаКалендаря, ЗакрыватьПриВыборе, МножественныйВыбор", ДатаКалендаряПриОткрытии, Истина, Ложь);
	ОткрытьФорму("ОбщаяФорма.ФормаКалендаря", СтруктураПараметров, ЭтаФорма);	
		
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеПериодаРегистрацииНачалоВыбораПослеВопроса(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Бригады.Очистить();
	ОтображениеПериодаРегистрацииНачалоВыбораЗавершение(ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеПериодаРегистрацииНачалоВыбораЗавершение(ВыбранноеЗначение)
	
	ОчиститьСообщения();
	Модифицированность = Истина;
	Объект.ПериодРегистрации 		= НачалоМесяца(ВыбранноеЗначение);
	ОтображениеПериодаРегистрации 	= Формат(Объект.ПериодРегистрации, "ДФ='MMMM yyyy'");
	ДатаНачалаГрафика = НачалоМесяца(Объект.ПериодРегистрации);
	ДатаОкончанияГрафика = КонецМесяца(Объект.ПериодРегистрации);
	
	ОбновитьГрафикСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеПериодаРегистрацииОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ФильтрТочкаПродажПриИзменении(Элемент)
	
	ОчиститьСообщения();
	ОбновитьГрафикСервер();
	ОтборСтрокТабличнойЧасти();

КонецПроцедуры

&НаКлиенте
Процедура ФильтрПодразделениеПриИзменении(Элемент)
	
	ОчиститьСообщения();
	ОбновитьГрафикСервер();
	ОтборСтрокТабличнойЧасти();
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантОтображенияГрафикаПриИзменении(Элемент)
	
	ОчиститьСообщения();
	ОбновитьГрафикСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура РежимРедактированияТабличнойЧастиПриИзменении(Элемент)
	
	ОчиститьСообщения();
	Если РежимРедактированияТабличнойЧасти = 0 Тогда
		Отказ = Ложь;
		ПроверкаТаблицыДокумента(Отказ);
		Если Отказ Тогда
			РежимРедактированияТабличнойЧасти = 1;
			Возврат;
		КонецЕсли;
		
		Элементы.СтраницыРежимовРедактирования.ТекущаяСтраница = Элементы.СтраницаГрафик;
		ОбновитьГрафикСервер();
	Иначе		
		Элементы.СтраницыРежимовРедактирования.ТекущаяСтраница = Элементы.СтраницаТаблица;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаТаблицыДокумента(Отказ)
	
	ОчиститьСообщения();
	
	Для каждого ЭлементТЧ из Объект.Бригады Цикл
		НайденныеСтроки = Объект.Бригады.НайтиСтроки(Новый Структура("Бригада", ЭлементТЧ.Бригада));
		Если НайденныеСтроки.Количество() > 1 Тогда
			НачалоПериода = Дата(Год(ЭлементТЧ.ДатаНачала), Месяц(ЭлементТЧ.ДатаНачала), День(ЭлементТЧ.ДатаНачала),
					Час(ЭлементТЧ.ВремяНачала), Минута(ЭлементТЧ.ВремяНачала), Секунда(ЭлементТЧ.ВремяНачала));
			КонецПериода = Дата(Год(ЭлементТЧ.ДатаОкончания), Месяц(ЭлементТЧ.ДатаОкончания), День(ЭлементТЧ.ДатаОкончания),
					Час(ЭлементТЧ.ВремяОкончания), Минута(ЭлементТЧ.ВремяОкончания), Секунда(ЭлементТЧ.ВремяОкончания));
			Для каждого ЭлементМассива из НайденныеСтроки Цикл
				Если ЭлементТЧ.НомерСтроки <> ЭлементМассива.НомерСтроки Тогда
					НачалоПериодаЭлемента = Дата(Год(ЭлементМассива.ДатаНачала), Месяц(ЭлементМассива.ДатаНачала), День(ЭлементМассива.ДатаНачала),
							Час(ЭлементМассива.ВремяНачала), Минута(ЭлементМассива.ВремяНачала), Секунда(ЭлементМассива.ВремяНачала));
					КонецПериодаЭлемента = Дата(Год(ЭлементМассива.ДатаОкончания), Месяц(ЭлементМассива.ДатаОкончания), День(ЭлементМассива.ДатаОкончания),
							Час(ЭлементМассива.ВремяОкончания), Минута(ЭлементМассива.ВремяОкончания), Секунда(ЭлементМассива.ВремяОкончания));
					Если НачалоПериодаЭлемента >= НачалоПериода И КонецПериодаЭлемента <= КонецПериода Тогда
						Сообщить("Данные в строках " + ЭлементТЧ.НомерСтроки + " и " + ЭлементМассива.НомерСтроки + " противоречат друг другу");
						Отказ = Истина;
						Возврат;
					КонецЕсли;
				КонецЕсли;				
			КонецЦикла;  
		КонецЕсли;
	КонецЦикла;
		
	// меньше/больше
	Для Каждого ЭлементТЧ Из Объект.Бригады Цикл
		Если ЭлементТЧ.ДатаОкончания < ЭлементТЧ.ДатаНачала Тогда
			Сообщить("В строке " + ЭлементТЧ.НомерСтроки + " дата окончания меньше даты начала");
			Отказ = Истина;			
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборПоБригадам(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Назначение", "Бригады");
	ПараметрыФормы.Вставить("ТочкаПродаж", ФильтрТочкаПродаж);
	ПараметрыФормы.Вставить("Подразделение", ФильтрПодразделение);
	ПараметрыФормы.Вставить("Период", Объект.ПериодРегистрации);
	
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораВГрафикРаботы", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение);
	
КонецПроцедуры	

&НаСервере
Процедура ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение)
	
	ТаблицаПодбора = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.ТаблицаПодбора);
	Назначение = ВыбранноеЗначение.Назначение;
	СписокБригад = ВыбранноеЗначение.Список;
	
	Если Назначение = "Бригады" Тогда
		Для каждого ЭлементСписка из СписокБригад Цикл			
			Для каждого СтрокаТаблицы Из ТаблицаПодбора Цикл
				Если СтрокаТаблицы.ДатаС >= НачалоМесяца(Объект.ПериодРегистрации) И СтрокаТаблицы.ДатаС <= КонецМесяца(Объект.ПериодРегистрации)
					И СтрокаТаблицы.ДатаПо >= НачалоМесяца(Объект.ПериодРегистрации) И СтрокаТаблицы.ДатаПо <= КонецМесяца(Объект.ПериодРегистрации) Тогда	
					НоваяСтрока = Объект.Бригады.Добавить();
					НоваяСтрока.Бригада 		= ЭлементСписка.Значение;
					НоваяСтрока.ДатаНачала 		= СтрокаТаблицы.ДатаС; 
					НоваяСтрока.ДатаОкончания 	= СтрокаТаблицы.ДатаПо;
					НоваяСтрока.ВремяНачала 	= СтрокаТаблицы.ВремяС;
					НоваяСтрока.ВремяОкончания  = СтрокаТаблицы.ВремяПо;
					НоваяСтрока.ТочкаПродаж 	= НоваяСтрока.Бригада.ТочкаПродаж;
					НоваяСтрока.Подразделение 	= НоваяСтрока.Бригада.Подразделение;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура БригадыПриИзменении(Элемент)
	ЗаполнитьВычисляемыеРеквизитыТабличнойЧасти();	
КонецПроцедуры

#КонецОбласти

#Область ГрафикПланировщик

&НаСервере
Процедура ОбновитьГрафикСервер()
	
	Если РежимРедактированияТабличнойЧасти = 1 Тогда
		Возврат;
	КонецЕсли;
	
	// формируем таблицу с данными для вывода на график	
	ТаблицаМонтажей.Очистить();
	ТаблицаБригад = МодульОтчетов.ПолучитьТаблицуБригад(ФильтрТочкаПродаж, ФильтрПодразделение);
	МассивБригад  = ТаблицаБригад.ВыгрузитьКолонку("Бригада");
	
	//получаем таблицу замеров/выездов/невыходов из регистра для отображения графика за заданный период
	ТаблицаМонтажейВрем = МодульОтчетов.ПолучитьТаблицуМонтажей(НачалоМесяца(Объект.ПериодРегистрации), КонецМесяца(Объект.ПериодРегистрации), МассивБригад);
	
	Для каждого СтрокаТЗ из ТаблицаМонтажейВрем Цикл		
		Если НЕ СтрокаТЗ.Регистратор = Объект.Ссылка Тогда
			НоваяСтрока = ТаблицаМонтажей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ, 
									"Регистратор, Бригада, Дата, ВремяНачала, ВремяОкончания, 
									|Адрес, Контрагент, КомментарийКМонтажу,
									|ИндексСтроки, Основание, ИДМонтажа");
		КонецЕсли;
	КонецЦикла;
	
	//добавим невыходы текущего документа
	Для Каждого НевыходТекущегоДокумента Из Объект.Бригады Цикл
		
		НоваяСтрока = ТаблицаМонтажей.Добавить();
		НоваяСтрока.Регистратор = Объект.Ссылка;
		НоваяСтрока.Бригада = НевыходТекущегоДокумента.Бригада;
		НоваяСтрока.Дата = НевыходТекущегоДокумента.ДатаНачала;
		НоваяСтрока.ВремяНачала  = ОбщийМодульКлиентСервер.СоединитьДатуИВремя(НевыходТекущегоДокумента.ДатаНачала, НевыходТекущегоДокумента.ВремяНачала);
		НоваяСтрока.ВремяОкончания = ОбщийМодульКлиентСервер.СоединитьДатуИВремя(НевыходТекущегоДокумента.ДатаОкончания, НевыходТекущегоДокумента.ВремяОкончания);
		НоваяСтрока.КомментарийКМонтажу = НевыходТекущегоДокумента.Комментарий;		
		НоваяСтрока.Выделять = Истина; 
	КонецЦикла;
	
	ТаблицаМонтажей.Сортировать("Бригада Возр");
	
	//Вариант отображения (горизонтальный / вертикальный)
	Развертка = ?(ВариантОтображенияГрафика = 0, 0, 1);
	
	Если ВариантОтображенияГрафика = 0 ИЛИ ВариантОтображенияГрафика = 1 Тогда
		НастройкиГрафика = МодульОтчетов.ИнициализироватьНастройкиПланировщикаГрафикаМонтажей(График, Развертка, ДатаНачалаГрафика, КонецДня(ДатаОкончанияГрафика));				
		МодульОтчетов.ЗаполнитьГрафикМонтажейКалендарьПоМонтажникам(График, НастройкиГрафика, ФильтрТочкаПродаж, ФильтрПодразделение, ТаблицаМонтажей, Истина);
	КонецЕсли;
	
	Если ТаблицаБригад.Количество() = 0 Тогда
		Элементы.График.ТолькоПросмотр = Истина;
		Сообщить("Отсутствуют бригады согласно указанным отборам!");
	Иначе
		Элементы.График.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикПриАктивизации(Элемент)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ГрафикВыбор(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Не Элементы.График.ВыделенныеЭлементы.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	ВыделенныйЭлемент = Элементы.График.ВыделенныеЭлементы[0];
	ДокументРегистратор = ВыделенныйЭлемент.Значение.Регистратор;
		
	Если Не ЗначениеЗаполнено(ДокументРегистратор) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", ДокументРегистратор);
	
	Если ТипЗнч(ДокументРегистратор) = Тип("ДокументСсылка.Лид") Тогда
		ОткрытьФорму("Документ.Лид.ФормаОбъекта", ПараметрыФормы);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ГрафикПередСозданием(Элемент, Начало, Конец, Значения, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	// если на графике нет бригад, то ничего не делаем
	Если Значения.Получить("Бригада") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//проверяем пересечения периодов
	Отказ = Ложь;
	Для Каждого СуществующаяЗапись Из ТаблицаМонтажей Цикл		
		Если СуществующаяЗапись.Бригада = Значения.Получить("Бригада") Тогда
			Если (СуществующаяЗапись.ВремяНачала > Начало ИЛИ СуществующаяЗапись.ВремяОкончания > Начало) 
				И (СуществующаяЗапись.ВремяНачала < Конец ИЛИ СуществующаяЗапись.ВремяОкончания < Конец) Тогда
				Отказ = Истина;							
			ИначеЕсли Начало = СуществующаяЗапись.ВремяНачала и Конец = СуществующаяЗапись.ВремяОкончания Тогда
				Отказ = Истина;						
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если Отказ Тогда
		Сообщить("Выбранный интервал занят");
		Возврат;
	Иначе
		НовыйНевыход = Объект.Бригады.Добавить();
		НовыйНевыход.Бригада = Значения.Получить("Бригада");
		НовыйНевыход.ДатаНачала = НачалоДня(Начало);
		НовыйНевыход.ДатаОкончания = НачалоДня(Конец);
		НовыйНевыход.ВремяНачала = Дата(1,1,1) + (Начало - НачалоДня(Начало));
		НовыйНевыход.ВремяОкончания = Дата(1,1,1) + (Конец - НачалоДня(Конец));
		НовыйНевыход.ТочкаПродаж 	= ОбщийМодульВызовСервера.ЗначениеРеквизитаОбъекта(НовыйНевыход.Бригада, "ТочкаПродаж");
		НовыйНевыход.Подразделение 	= ОбщийМодульВызовСервера.ЗначениеРеквизитаОбъекта(НовыйНевыход.Бригада, "Подразделение");
			
		ОбновитьГрафикСервер();
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикПриОкончанииРедактирования(Элемент, НовыйЭлемент, ОтменаРедактирования)
	
	ОтменаРедактирования = Истина;
	Возврат;
		
КонецПроцедуры

&НаКлиенте
Процедура ГрафикПередНачаломРедактирования(Элемент, НовыйЭлемент, СтандартнаяОбработка)
	Если НЕ НовыйЭлемент Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГрафикПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	Если Элемент.ВыделенныеЭлементы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивЭлементовУдаления = Новый Массив;
	ТекстВопроса = "Для удаления выбраны элементы:" + Символы.ПС;
	Для каждого СтрокаНевыхода из Элемент.ВыделенныеЭлементы Цикл
		Если СтрокаНевыхода.Значение.Регистратор <> Объект.Ссылка Тогда
			Сообщить("Выбраны элементы, не принадлежащие данному документу");
			Возврат;
		КонецЕсли;
		
		МассивЭлементовУдаления.Добавить(Новый Структура("Начало, Конец, Бригада", СтрокаНевыхода.Начало, СтрокаНевыхода.Конец, СтрокаНевыхода.ЗначенияИзмерений.Получить("Бригада")));
		ТекстВопроса = ТекстВопроса + Строка(СтрокаНевыхода.Начало) + " - " + Строка(СтрокаНевыхода.Конец) + " " + Строка(СтрокаНевыхода.ЗначенияИзмерений.Получить("Бригада")) + Символы.ПС; 
	КонецЦикла;
	ТекстВопроса = ТекстВопроса + "Подтверждаете выполнение действия?";
	ОписаниеОповещения = Новый ОписаниеОповещения("УдалениеЭлементовГрафикаПослеВопроса", ЭтотОбъект, МассивЭлементовУдаления); 
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалениеЭлементовГрафикаПослеВопроса(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	МассивЭлементовУдаления = ДополнительныеПараметры;
	
	Для каждого ЭлементМассива из МассивЭлементовУдаления Цикл
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ДатаНачала", НачалоДня(ЭлементМассива.Начало));
		СтруктураОтбора.Вставить("ДатаОкончания", НачалоДня(ЭлементМассива.Конец));
		СтруктураОтбора.Вставить("ВремяНачала", Дата(1,1,1) + (ЭлементМассива.Начало - НачалоДня(ЭлементМассива.Начало)));
		СтруктураОтбора.Вставить("ВремяОкончания", Дата(1,1,1) + (ЭлементМассива.Конец - НачалоДня(ЭлементМассива.Конец)));
		СтруктураОтбора.Вставить("Бригада", ЭлементМассива.Бригада);
		НайденныеСтроки = Объект.Бригады.НайтиСтроки(СтруктураОтбора);
		Если НайденныеСтроки.Количество() > 0 Тогда
			Объект.Бригады.Удалить(НайденныеСтроки[0].НомерСтроки-1);
		КонецЕсли;
	КонецЦикла;
	
	ОбновитьГрафикСервер();
	Модифицированность = Истина;
		
КонецПроцедуры

&НаКлиенте
Процедура ГрафикПриСменеТекущегоПериодаОтображения(Элемент, ТекущиеПериодыОтображения, СтандартнаяОбработка)
	// например при прокрутке ролика мыши
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ГрафикПередНачаломБыстрогоРедактирования(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Возврат;
КонецПроцедуры

&НаКлиенте
Процедура ГрафикНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	Выполнение = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ГрафикПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Дата, Значения)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКомментарий(Команда)
	Если Элементы.График.ВыделенныеЭлементы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивЭлементовИзменения = Новый Массив;
	ПервоначальныйКомментарий = "";
	Для каждого СтрокаНевыхода из Элементы.График.ВыделенныеЭлементы Цикл
		Если СтрокаНевыхода.Значение.Регистратор <> Объект.Ссылка Тогда
			Сообщить("Выбраны элементы, не принадлежащие данному документу");
			Возврат;
		КонецЕсли;
		
		МассивЭлементовИзменения.Добавить(Новый Структура("Начало, Конец, Бригада", СтрокаНевыхода.Начало, СтрокаНевыхода.Конец, СтрокаНевыхода.ЗначенияИзмерений.Получить("Бригада")));
	КонецЦикла;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьКомментарийЗавершение", ЭтотОбъект, МассивЭлементовИзменения); 
	ПоказатьВводСтроки(ОписаниеОповещения, ПервоначальныйКомментарий);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКомментарийЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивЭлементовИзменения = ДополнительныеПараметры;

	Для каждого ЭлементМассива из МассивЭлементовИзменения Цикл
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ДатаНачала", НачалоДня(ЭлементМассива.Начало));
		СтруктураОтбора.Вставить("ДатаОкончания", НачалоДня(ЭлементМассива.Конец));
		СтруктураОтбора.Вставить("ВремяНачала", Дата(1,1,1) + (ЭлементМассива.Начало - НачалоДня(ЭлементМассива.Начало)));
		СтруктураОтбора.Вставить("ВремяОкончания", Дата(1,1,1) + (ЭлементМассива.Конец - НачалоДня(ЭлементМассива.Конец)));
		СтруктураОтбора.Вставить("Бригада", ЭлементМассива.Бригада);
		НайденныеСтроки = Объект.Бригады.НайтиСтроки(СтруктураОтбора);
		Если НайденныеСтроки.Количество() > 0 Тогда
			НайденныеСтроки[0].Комментарий = Результат;
		КонецЕсли;
	КонецЦикла;
	
	ОбновитьГрафикСервер();
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеПериодомГрафика

&НаКлиенте
Процедура ДатаНачалаГрафикаПриИзменении(Элемент)
	
	Если ДатаНачалаГрафика = Дата(1,1,1) ИЛИ ДатаНачалаГрафика < НачалоМесяца(Объект.ПериодРегистрации) Тогда
		ДатаНачалаГрафика = НачалоМесяца(Объект.ПериодРегистрации);
	ИначеЕсли ДатаНачалаГрафика > КонецМесяца(Объект.ПериодРегистрации) Тогда
		ДатаНачалаГрафика = КонецМесяца(Объект.ПериодРегистрации);
		ДатаОкончанияГрафика = КонецМесяца(Объект.ПериодРегистрации);
	ИначеЕсли ДатаНачалаГрафика > ДатаОкончанияГрафика Тогда
		ДатаНачалаГрафика = ДатаОкончанияГрафика;
	КонецЕсли;
	
	ОбновитьСостояниеКнопокИнтервалаПриИзмененииДат();
	
	ОбновитьГрафикСервер();
		
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияГрафикаПриИзменении(Элемент)
	
	Если ДатаОкончанияГрафика = Дата(1,1,1) ИЛИ ДатаОкончанияГрафика > КонецМесяца(Объект.ПериодРегистрации) Тогда
		ДатаОкончанияГрафика = КонецМесяца(Объект.ПериодРегистрации);
	ИначеЕсли ДатаОкончанияГрафика < НачалоМесяца(Объект.ПериодРегистрации) Тогда
		ДатаНачалаГрафика = НачалоМесяца(Объект.ПериодРегистрации);
		ДатаОкончанияГрафика = НачалоМесяца(Объект.ПериодРегистрации);
	ИначеЕсли ДатаНачалаГрафика > ДатаОкончанияГрафика Тогда
		ДатаОкончанияГрафика = ДатаНачалаГрафика;
	КонецЕсли;
	
	ОбновитьСостояниеКнопокИнтервалаПриИзмененииДат();
	
	ОбновитьГрафикСервер();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьДень(Команда)
	
	ДатаНачалаГрафика = Объект.ПериодРегистрации;
	ДатаОкончанияГрафика = Объект.ПериодРегистрации;
	
	СнятьПометкиКнопокИнтервала();             
	Элементы.УстановитьДень.Пометка = Истина;
	ОбновитьДоступностьКнопокСдвигаПриИзмененииДат();
	
	ОбновитьГрафикСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНеделя(Команда)
	
	ДатаНачалаГрафика = Объект.ПериодРегистрации;
	ДатаОкончанияГрафика = Объект.ПериодРегистрации + 60*60*24*6;
	
	СнятьПометкиКнопокИнтервала();               
	Элементы.УстановитьНеделя.Пометка = Истина;
	ОбновитьДоступностьКнопокСдвигаПриИзмененииДат();

	ОбновитьГрафикСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьМесяц(Команда)
	
	ДатаНачалаГрафика = НачалоМесяца(Объект.ПериодРегистрации);
	ДатаОкончанияГрафика = КонецМесяца(Объект.ПериодРегистрации);
	
	СнятьПометкиКнопокИнтервала();              
	Элементы.УстановитьМесяц.Пометка = Истина;
	ОбновитьДоступностьКнопокСдвигаПриИзмененииДат();

	ОбновитьГрафикСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометкиКнопокИнтервала()
	
	Элементы.УстановитьДень.Пометка = Ложь;  
	Элементы.УстановитьНеделя.Пометка = Ложь; 
	Элементы.УстановитьМесяц.Пометка = Ложь;  

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
    Диалог = Новый ДиалогРедактированияСтандартногоПериода();                                 
    Диалог.Период = Новый СтандартныйПериод(ДатаНачалаГрафика, ДатаОкончанияГрафика);        
    ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
    Диалог.Показать(ОписаниеОповещенияОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.ДатаНачала > КонецМесяца(Объект.ПериодРегистрации) ИЛИ Результат.ДатаНачала < НачалоМесяца(Объект.ПериодРегистрации)
		ИЛИ Результат.ДатаОкончания > КонецМесяца(Объект.ПериодРегистрации) ИЛИ Результат.ДатаОкончания < НачалоМесяца(Объект.ПериодРегистрации) Тогда
		Возврат;			 
	КонецЕсли;
			
    ДатаНачалаГрафика = Результат.ДатаНачала;
    ДатаОкончанияГрафика = Результат.ДатаОкончания;	
	
	ОбновитьСостояниеКнопокИнтервалаПриИзмененииДат();
	ОбновитьГрафикСервер();
	
КонецПроцедуры

&НаКлиенте	
Процедура ОбновитьСостояниеКнопокИнтервалаПриИзмененииДат()
	
	СнятьПометкиКнопокИнтервала();
	Если НачалоДня(ДатаНачалаГрафика) = НачалоДня(ДатаОкончанияГрафика) Тогда
		Элементы.УстановитьДень.Пометка = Истина;
		
	ИначеЕсли НачалоДня(ДатаОкончанияГрафика) = НачалоДня(ДатаНачалаГрафика + 60*60*24*6) Тогда
		Элементы.УстановитьНеделя.Пометка = Истина;
		
	ИначеЕсли ДатаНачалаГрафика = НачалоМесяца(Объект.ПериодРегистрации) И ДатаОкончанияГрафика = КонецМесяца(Объект.ПериодРегистрации) Тогда
		Элементы.УстановитьМесяц.Пометка = Истина;
		
	КонецЕсли;
	
	ОбновитьДоступностьКнопокСдвигаПриИзмененииДат();
	
КонецПроцедуры

&НаКлиенте	
Процедура ОбновитьДоступностьКнопокСдвигаПриИзмененииДат()
	
	ДоступностьКнопокСдвига = Элементы.УстановитьДень.Пометка ИЛИ Элементы.УстановитьНеделя.Пометка ИЛИ Элементы.УстановитьМесяц.Пометка;
	Элементы.СдвинутьИнтервалВлево.Доступность  = ДоступностьКнопокСдвига;
	Элементы.СдвинутьИнтервалВправо.Доступность = ДоступностьКнопокСдвига;

КонецПроцедуры

&НаКлиенте
Процедура СдвинутьИнтервалВлево(Команда)
	СдвинутьДату(-1);
КонецПроцедуры

&НаКлиенте
Процедура СдвинутьИнтервалВправо(Команда)
	СдвинутьДату();
КонецПроцедуры

&НаКлиенте
Процедура СдвинутьДату(Знак=1)
	
	//#8387
	Если Элементы.УстановитьДень.Пометка Тогда
		Если Знак = -1 Тогда
			ДатаНачалаГрафика 	= Макс(НачалоМесяца(Объект.ПериодРегистрации), ДатаНачалаГрафика + Знак*86400);
			ДатаОкончанияГрафика = ДатаНачалаГрафика;
		Иначе
			ДатаНачалаГрафика 	= Мин(КонецМесяца(Объект.ПериодРегистрации), ДатаНачалаГрафика + Знак*86400);
			ДатаОкончанияГрафика = ДатаНачалаГрафика;
		КонецЕсли;
		
	ИначеЕсли Элементы.УстановитьНеделя.Пометка Тогда
		Если Знак = -1 Тогда
			ДатаНачалаГрафика 	= Макс(НачалоМесяца(Объект.ПериодРегистрации), ДатаНачалаГрафика + Знак*86400*7);
			ДатаОкончанияГрафика = Макс(НачалоМесяца(Объект.ПериодРегистрации), ДатаНачалаГрафика + Знак*86400*7);
		Иначе
			ДатаНачалаГрафика 	= Мин(КонецМесяца(Объект.ПериодРегистрации), ДатаНачалаГрафика + Знак*86400*7);
			ДатаОкончанияГрафика = Мин(КонецМесяца(Объект.ПериодРегистрации), ДатаНачалаГрафика + Знак*86400*7);
		КонецЕсли;
		
	ИначеЕсли Элементы.УстановитьМесяц.Пометка Тогда
		// месяцы не двигаются 
		
	КонецЕсли;
	
	ОбновитьГрафикСервер();
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура ЗаполнитьВычисляемыеРеквизитыТабличнойЧасти()
	
	Для каждого СтрокаТЧ из Объект.Бригады Цикл
		СтрокаТЧ.ТочкаПродаж = СтрокаТЧ.Бригада.ТочкаПродаж;
		СтрокаТЧ.Подразделение = СтрокаТЧ.Бригада.Подразделение;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОтборСтрокТабличнойЧасти()
	
	Элементы.Бригады.ОтборСтрок = Неопределено; // сначала очищаем
	Элементы.БригадыБригада.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив);
	
	Если ФильтрТочкаПродаж.Пустая() И ФильтрПодразделение.Пустая() Тогда
		//
		
	ИначеЕсли НЕ ФильтрТочкаПродаж.Пустая() И ФильтрПодразделение.Пустая() Тогда
		Элементы.Бригады.ОтборСтрок = Новый ФиксированнаяСтруктура("ТочкаПродаж", ФильтрТочкаПродаж);
		
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(Новый ПараметрВыбора("Отбор.ТочкаПродаж", ФильтрТочкаПродаж));
		Элементы.БригадыБригада.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассив);
		
	ИначеЕсли ФильтрТочкаПродаж.Пустая() И НЕ ФильтрПодразделение.Пустая() Тогда
		Элементы.Бригады.ОтборСтрок = Новый ФиксированнаяСтруктура("Подразделение", ФильтрПодразделение);
		
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(Новый ПараметрВыбора("Отбор.Подразделение", ФильтрПодразделение));
		Элементы.БригадыБригада.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассив);
		
	ИначеЕсли НЕ ФильтрТочкаПродаж.Пустая() И НЕ ФильтрПодразделение.Пустая() Тогда
		Элементы.Бригады.ОтборСтрок = Новый ФиксированнаяСтруктура("ТочкаПродаж, Подразделение", ФильтрТочкаПродаж, ФильтрПодразделение);
		
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(Новый ПараметрВыбора("Отбор.ТочкаПродаж", ФильтрТочкаПродаж));
		НовыйМассив.Добавить(Новый ПараметрВыбора("Отбор.Подразделение", ФильтрПодразделение));
		Элементы.БригадыБригада.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассив);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
